       IDENTIFICATION DIVISION.
       PROGRAM-ID. CURRENT-DATE-DEMO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DATETIME PIC X(21) VALUE SPACES.
       PROCEDURE DIVISION.
           MOVE FUNCTION CURRENT-DATE TO WS-DATETIME
           DISPLAY "DateTime: " WS-DATETIME
           STOP RUN.
