IDENTIFICATION DIVISION.
PROGRAM-ID. MY-HYPHENATED-PROGRAM.

PROCEDURE DIVISION.
    DISPLAY "Program with hyphenated ID running".
    DISPLAY "Name: MY-HYPHENATED-PROGRAM".
    STOP RUN.
