       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT-TIME.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TIME PIC 9(8) VALUE 0.
       PROCEDURE DIVISION.
           ACCEPT WS-TIME FROM TIME
           DISPLAY "Time: " WS-TIME
           STOP RUN.
