IDENTIFICATION DIVISION.
PROGRAM-ID. GOBACK-DEMO.

PROCEDURE DIVISION.
    DISPLAY "Before GOBACK".
    DISPLAY "Returning to caller".
    GOBACK.
    DISPLAY "Unreachable after GOBACK".
