       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT-DATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DATE PIC 9(8) VALUE 0.
       PROCEDURE DIVISION.
           ACCEPT WS-DATE FROM DATE YYYYMMDD
           DISPLAY "Date: " WS-DATE
           STOP RUN.
