       IDENTIFICATION DIVISION.
       PROGRAM-ID. GET-VALUE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-OUT PIC 9(5) VALUE 12345.

       PROCEDURE DIVISION.
           MOVE WS-OUT TO RETURN-CODE
           GOBACK.
