IDENTIFICATION DIVISION.
PROGRAM-ID. DISPLAY-MULTIPLE.

PROCEDURE DIVISION.
    DISPLAY "Line 1: First line of output".
    DISPLAY "Line 2: Second line of output".
    DISPLAY "Line 3: Third line of output".
    STOP RUN.
