       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-MULTI.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A   PIC 9(3) VALUE 010.
       01 WS-B   PIC 9(3) VALUE 020.
       01 WS-RES PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
           CALL "ADD-NUMS" USING WS-A WS-B WS-RES
           DISPLAY "Result: " WS-RES
           STOP RUN.
