       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAX-MIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC 9(3) VALUE 030.
       01 WS-B PIC 9(3) VALUE 050.
       01 WS-C PIC 9(3) VALUE 010.
       01 WS-MAX PIC 9(3) VALUE 0.
       01 WS-MIN PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
           COMPUTE WS-MAX = FUNCTION MAX(WS-A, WS-B, WS-C)
           COMPUTE WS-MIN = FUNCTION MIN(WS-A, WS-B, WS-C)
           DISPLAY "Max: " WS-MAX
           DISPLAY "Min: " WS-MIN
           STOP RUN.
