       IDENTIFICATION DIVISION.
       PROGRAM-ID. FUNCTION-MOD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A   PIC 9(3) VALUE 017.
       01 WS-B   PIC 9(3) VALUE 005.
       01 WS-RES PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
           COMPUTE WS-RES = FUNCTION MOD(WS-A, WS-B)
           DISPLAY "17 mod 5 = " WS-RES
           STOP RUN.
