       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-EXTERNAL.
       PROCEDURE DIVISION.
           DISPLAY "Before call"
           CALL "GREET-SUB"
           DISPLAY "After call"
           STOP RUN.
