       IDENTIFICATION DIVISION.
       PROGRAM-ID. FUNCTION-LENGTH.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR PIC X(10) VALUE "Hello".
       01 WS-LEN PIC 9(3)  VALUE 0.

       PROCEDURE DIVISION.
           MOVE FUNCTION LENGTH(WS-STR) TO WS-LEN
           DISPLAY "Length: " WS-LEN
           STOP RUN.
