       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVE-STRING.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GREETING        PIC X(20).

       PROCEDURE DIVISION.
           MOVE "Hello, COBOL!" TO WS-GREETING
           DISPLAY WS-GREETING
           STOP RUN.
