       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD-TEN.

       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-VAL PIC 9(3).

       PROCEDURE DIVISION USING LS-VAL.
           ADD 10 TO LS-VAL
           GOBACK.
