       IDENTIFICATION DIVISION.
       PROGRAM-ID. REF-MODIFICATION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR PIC X(10) VALUE "ABCDEFGHIJ".

       PROCEDURE DIVISION.
           DISPLAY "Full: " WS-STR
           DISPLAY "Sub:  " WS-STR(3:4)
           STOP RUN.
