       IDENTIFICATION DIVISION.
       PROGRAM-ID. FUNCTION-UPPER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR    PIC X(10) VALUE "hello".
       01 WS-RESULT PIC X(10) VALUE SPACES.

       PROCEDURE DIVISION.
           MOVE FUNCTION UPPER-CASE(WS-STR) TO WS-RESULT
           DISPLAY "Upper: [" WS-RESULT "]"
           STOP RUN.
