       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOWER-CASE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR    PIC X(10) VALUE "HELLO".
       01 WS-RESULT PIC X(10) VALUE SPACES.
       PROCEDURE DIVISION.
           MOVE FUNCTION LOWER-CASE(WS-STR) TO WS-RESULT
           DISPLAY "Lower: [" WS-RESULT "]"
           STOP RUN.
