       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE-REMAINDER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIVIDEND  PIC 9(4) VALUE 1007.
       01 WS-DIVISOR   PIC 9(3) VALUE 25.
       01 WS-QUOTIENT  PIC 9(4) VALUE 0.
       01 WS-REM       PIC 9(3) VALUE 0.

       PROCEDURE DIVISION.
           DIVIDE WS-DIVISOR INTO WS-DIVIDEND
             GIVING WS-QUOTIENT REMAINDER WS-REM
           DISPLAY "Dividend:  " WS-DIVIDEND
           DISPLAY "Divisor:   " WS-DIVISOR
           DISPLAY "Quotient:  " WS-QUOTIENT
           DISPLAY "Remainder: " WS-REM
           STOP RUN.
